d1 = {"a": "Սուրճ դնելը ", "b": "Ֆուտբոլ խաղալը թ․", "c": "բալետ պարելը․",         "d": " արագ իրացվելի միջոց լինելը, որը յուրաքանչյուր պահի  կարող է վերածվել ցանկացած ապրանքի․"}
d11 = "a- Սուրճ պատրաստելը \n b - Ֆուտբոլ խաղալը \n c - բալետ պարելը \n d - արագ իրացվելի միջոց լինելը,որը յուրաքանչյուր պահի կարող է վերածվել ցանկացած ապրանքի․"

d2 = {"a": "Հաֆնիում", "b": "Կոբալտ", "c": "Տելուր", "d": "Բերիլիում"}
d3 = {"a": "Տիտանիկ", "b": "Ուոլ Սթրիթի Գայլը", "c": "Ֆոկուս", "d": "Բռնիր ինձ, թե կարող ես"}
d4 = {"a": "խաղաղաություն", "b": "խաղալիքներ", "c": "խաղաթղթեր", "d": "խմիչքներ"}
d5 = {"a": "4", "b": "5", "c": "3", "d": "6"}
d6 = {"a": "Բրազիլիա", "b": "Արգենտինա", "c": "Կոլումբիա", "d": "Պերու", }
d7 = {"a": "Ցավի", "b": "տոնածառի", "c": "կնոջդ կրունկի", "d": "գիլիոտինի"}
d8 = {"a": "10", "b": "Ոչ մի", "c": "5", "d": "20"}
d9 = {"a": "Ինդիանապոլիս", "b": "Միլուոկի", "c": "Արմենիա", "d": "Սկյուտար"}
d10 = {"a": "1929 թ", "b": "1935 թ", "c": "1930թ", "d": "1940 թ"}

import random

x = "yes"
while x == "yes":
    tem = ["կանխիկ", "վճարային քարտ","վճարային փող"]
    tema = random.choice(tem)
    if tema = "կանխիկ":
            while True:
                player = input("բարի գալուստ ով է ուզում ստանալ  միավորներ խաղը՝ \n մուտքագրեք ձեր անունը՝ ")
                print(player, " խաղը սկսված է՝")
                print("1 հարց՝ \n   Որն է փողի ֆունկցիան ?\n", d11)
                answer = input("մուտքագրեք ձեր տարբերակը՝: ")
                if answer == "d":
                    print("դուք շահեցիք 1 միավոր", "\n" * 3)
                else:
                    print("ցավոք ձեր պատասխանը սխալ է, դուք միավորներ չվաստակեցիք: ուշադիր եղեք և ավելի լավ ուսումնասիրեք  այս թեման")
                break
        print("2 հարց \n Որ քիմիական տարրն է անվանել ի պատիվ ստորգետնյա չար թզուկի \n", d2)
        answer = input("եթե ցանկանում եք վերցնել գումարը մուտքագրեք` y \n Մուտքագրեք ձեր տարբերակը՝: ")
        if answer == "b":
            print("դուք շահեցիք 1000 դրամ", "\n" * 3)
        elif answer == "y":
            print("ձեր վաստակած գումարն է 500 դրամ", "\n" * 3)
            break
        else:
            print("ցավոք ձեր պատասխանը սխալ է, հաջողություն հետագա խաղերի ընթացքում!")
            break
        print("3 հարց \n Հետևյալ ֆիլմերից որում չի նկարահանվել Լեոնարդո Դի Կապռիոն։ \n", d3)
        answer = input("եթե ցանկանում եք վերցնել գումարը մուտքագրեք` y \n Մուտքագրեք ձեր տարբերակը՝: ")
        if answer == "c":
            print("դուք շահեցիք 2000 դրամ", "\n" * 3)
        elif answer == "y":
            print("ձեր վաստակած գումարն է 1000 դրամ", "\n" * 3)
            break
        else:
            print("ցավոք ձեր պատասխանը սխալ է, հաջողություն հետագա խաղերի ընթացքում!")
            break
        print("4 հարց \n Ձմեռ պապը երեխաններին բերում է ․․․ \n", d4)
        answer = input("եթե ցանկանում եք վերցնել գումարը մուտքագրեք` y \n Մուտքագրեք ձեր տարբերակը՝: ")
        if answer == "b":
            print("դուք շահեցիք 4000 դրամ", "\n" * 3)
        elif answer == "y":
            print("ձեր վաստակած գումարն է 2000 դրամ", "\n" * 3)
            break
        else:
            print("ցավոք ձեր պատասխանը սխալ է, հաջողություն հետագա խաղերի ընթացքում!")
            break
        print("5 հարց \n Քանի ծով է ողողում Բալկանյան թերակղզին \n", d5)
        answer = input("եթե ցանկանում եք վերցնել գումարը մուտքագրեք` y \n Մուտքագրեք ձեր տարբերակը՝: ")
        if answer == "d":
            print("դուք շահեցիք 8000 դրամ", "\n" * 3)
        elif answer == "y":
            print("ձեր վաստակած գումարն է 4000 դրամ", "\n" * 3)
            break
        else:
            print("ցավոք ձեր պատասխանը սխալ է, հաջողություն հետագա խաղերի ընթացքում!")
            break
        print("6 հարց \n Որ պետությունով է հոսում Ամազոն գետը \n", d6)
        answer = input("եթե ցանկանում եք վերցնել գումարը մուտքագրեք` y \n Մուտքագրեք ձեր տարբերակը՝: ")
        if answer == "a":
            print("դուք շահեցիք 16000 դրամ, որը անձեռնամխելի է", "\n" * 3)
        elif answer == "y":
            print("ձեր վաստակած գումարն է 8000 դրամ", "\n" * 3)
            break
        else:
            print("ցավոք ձեր պատասխանը սխալ է, հաջողություն հետագա խաղերի ընթացքում!\n Դուք վաստակեցիք 8000 դր")
            break
        print("7 հարց \n Ժողովրդական խոսք. «Անցավ գլուխդ մի` դիր (ինչի՞) տակ» \n", d7)
        answer = input("եթե ցանկանում եք վերցնել գումարը մուտքագրեք` y \n Մուտքագրեք ձեր տարբերակը՝: ")
        if answer == "a":
            print("դուք շահեցիք 32000 դրամ", "\n" * 3)
        elif answer == "y":
            print("ձեր վաստակած գումարն է 16000 դրամ", "\n" * 3)
            break
        else:
            print("ցավոք ձեր պատասխանը սխալ է, հաջողություն հետագա խաղերի ընթացքում!\n Դուք վաստակեցիք 8000 դր")
            break
        print("8 հարց \n Քանի սև կետ են ունենում նոր ծնված Դալմատին ցեղատեսակի շները \n", d8)
        answer = input("եթե ցանկանում եք վերցնել գումարը մուտքագրեք` y \n Մուտքագրեք ձեր տարբերակը՝: ")
        if answer == "b":
            print("դուք շահեցիք 64000 դրամ", "\n" * 3)
        elif answer == "y":
            print("ձեր վաստակած գումարն է 32000 դրամ", "\n" * 3)
            break
        else:
            print("ցավոք ձեր պատասխանը սխալ է, հաջողություն հետագա խաղերի ընթացքում!\n Դուք վաստակեցիք 8000 դր")
            break
        print("9 հարց \n Որ տարբերակում «թաքնված չէ» ԱՄՆ նահանգի անվանում \n", d9)
        answer = input("եթե ցանկանում եք վերցնել գումարը մուտքագրեք` y \n Մուտքագրեք ձեր տարբերակը՝: ")
        if answer == "b":
            print("դուք շահեցիք 125000 դրամ", "\n" * 3)
        elif answer == "y":
            print("ձեր վաստակած գումարն է 64000 դրամ", "\n" * 3)
            break
        else:
            print("ցավոք ձեր պատասխանը սխալ է, հաջողություն հետագա խաղերի ընթացքում!\n Դուք վաստակեցիք 8000 դր")
            break
        print("10 հարց \n Որ թվականինե անցկացվել Ֆուտբոլի միջազգային առաջին առաջնություն  \n", d10)
        answer = input("եթե ցանկանում եք վերցնել գումարը մուտքագրեք` y \n Մուտքագրեք ձեր տարբերակը՝: ")
        if answer == "c":
            print("դուք շահեցիք 250000 դրամ \n Շնորհավորում եմ դուք հաղթեցիք Ով է Ուզում դառնալ Միլիոնատեր խաղում")
        elif answer == "y":
            print("ձեր վաստակած գումարն է 125000 դրամ")
            break
        else:
            print("ցավոք ձեր պատասխանը սխալ է, հաջողություն հետագա խաղերի ընթացքում! \n Դուք վաստակեցիք 8000 դր")
            break
    x = input(
        " խաղից դուրս գալու համար մուտքագրեք ` no իսկ նորից խաղալու համար մուտքագրեք ` yes \n Մուտքագրեք ձեր տարբերակը՝: ")
    if x == "no":
        break